### Ревью - Христолюбов Егор ФТ-104-1


##### Минусы
* ОТСУТСВУЮТ КАК ЖЕ ОНИ ХОРОШО НАПИСАЛИ ЭТОТ КОД


##### Плюсы
* Очень понятная и подробное разбиение на файлы, методы и др.
* Понятные комментарии
* Перменные и названия методов помогают повысить читаемость кода


##### Предложения
* Отрисовки можно отнести в отельный файл чтобы не захламлять файлы кучей однотипных строчек
* Стоить проверить в файле Random будет ли выдавать ошибку при значении UpperBound 0 и возможно ли возникновение такого (35 строчка)
